app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
      redirect_to book_path(@book.id), notice:'Book was successfully create.'
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "e"], ["body", "e"], ["created_at", "2022-01-24 12:52:03.520163"], ["updated_at", "2022-01-24 12:52:03.520163"]]
SELECT "books".* FROM "books"